# Bonus: Temperature Analysis I

In [60]:
import pandas as pd
import matplotlib.pyplot as plt
# import scipy.stats as st
import numpy as np
from datetime import datetime as dt

In [61]:
# "tobs" is "temperature observations"
df = pd.read_csv("Resources/hawaii_measurements.csv")
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [62]:
df.dtypes

station     object
date        object
prcp       float64
tobs         int64
dtype: object

In [63]:
# Convert the date column format from string to datetime
df["date"] = pd.to_datetime(df["date"])
df.dtypes

station            object
date       datetime64[ns]
prcp              float64
tobs                int64
dtype: object

In [64]:
# Set the date column as the DataFrame index
df.set_index("date", inplace=True)
df.head()

                station  prcp  tobs
date
2010-01-01  USC00519397  0.08    65
2010-01-02  USC00519397  0.00    63
2010-01-03  USC00519397  0.00    74
2010-01-04  USC00519397  0.00    76
2010-01-06  USC00519397   NaN    73

In [65]:
# Drop the date column
df['day'] = df.index.day
df['month'] = df.index.month
df['year'] = df.index.year

In [66]:
df.head()

                station  prcp  tobs  day  month  year
date
2010-01-01  USC00519397  0.08    65    1      1  2010
2010-01-02  USC00519397  0.00    63    2      1  2010
2010-01-03  USC00519397  0.00    74    3      1  2010
2010-01-04  USC00519397  0.00    76    4      1  2010
2010-01-06  USC00519397   NaN    73    6      1  2010

In [67]:
df.reset_index(drop=True, inplace=True)
df.head()

       station  prcp  tobs  day  month  year
0  USC00519397  0.08    65    1      1  2010
1  USC00519397  0.00    63    2      1  2010
2  USC00519397  0.00    74    3      1  2010
3  USC00519397  0.00    76    4      1  2010
4  USC00519397   NaN    73    6      1  2010

### Compare June and December data across all years

In [68]:
from scipy import stats

In [83]:
df_station = df.loc[:, ["station", "tobs", "month"]]
df_station.head()

       station  tobs  month
0  USC00519397    65      1
1  USC00519397    63      1
2  USC00519397    74      1
3  USC00519397    76      1
4  USC00519397    73      1

In [89]:
df_stat_grp = df_station.groupby('station')
# df_grp_month = df_stat_grp.groupby('month')
# df_stat_grp.head(5)

In [69]:
# Filter data for desired months
df_june = df.loc[:, ["tobs", "month"]]
df_june1 = df_june.loc[(df_june["month"]==6)]

df_dec= df_june.loc[(df_june["month"]==12)]

df_dec.head()

     tobs  month
305    76     12
306    74     12
307    74     12
308    64     12
309    64     12

In [70]:
# Identify the average temperature for June
df_june2 =df_june1.groupby('month').mean()
df_june2

            tobs
month
6      74.944118

In [71]:
# Identify the average temperature for December
df_dec1=df_dec.groupby('month').mean()
df_dec1.head()

            tobs
month
12     71.041529

In [79]:
# Create collections of temperature data
dec_avg = df_dec.values[0]
june_avg = df_june.values[0]
june_avg

array([65,  1], dtype=int64)

In [78]:
# Run paired t-test
# stats.ttest_ind(june_avg, dec_avg, equal_var=False)
stats.ttest_ind(june_avg, dec_avg, equal_var = False)

Ttest_indResult(statistic=nan, pvalue=nan)

### Analysis